results/4-loadtest/google_go_800.txt
Running 1m test @ https://europe-west1-double-catfish-238707.cloudfunctions.net/Go_matrix
  2 threads and 800 connections
  Thread calibration: mean lat.: 456.698ms, rate sampling interval: 2856ms
  Thread calibration: mean lat.: 404.661ms, rate sampling interval: 2590ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    98.39ms  109.68ms   4.80s    93.64%
    Req/Sec   401.03     25.92   433.00     58.82%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   69.50ms
 75.000%  123.65ms
 90.000%  179.97ms
 99.000%  416.00ms
 99.900%    1.14s 
 99.990%    3.92s 
 99.999%    4.80s 
100.000%    4.80s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      31.839     0.000000            1         1.00
      38.463     0.100000         3874         1.11
      41.663     0.200000         7690         1.25
      46.623     0.300000        11527         1.43
      55.903     0.400000        15370         1.67
      69.503     0.500000        19202         2.00
      78.783     0.550000        21118         2.22
      89.791     0.600000        23047         2.50
     101.183     0.650000        24956         2.86
     111.359     0.700000        26873         3.33
     123.647     0.750000        28797         4.00
     131.327     0.775000        29753         4.44
     138.239     0.800000        30715         5.00
     147.199     0.825000        31691         5.71
     156.031     0.850000        32633         6.67
     166.655     0.875000        33593         8.00
     172.543     0.887500        34072         8.89
     179.967     0.900000        34559        10.00
     187.647     0.912500        35043        11.43
     196.991     0.925000        35512        13.33
     209.279     0.937500        35992        16.00
     216.447     0.943750        36231        17.78
     225.279     0.950000        36471        20.00
     236.927     0.956250        36711        22.86
     250.623     0.962500        36952        26.67
     265.727     0.968750        37194        32.00
     279.039     0.971875        37313        35.56
     292.607     0.975000        37434        40.00
     307.199     0.978125        37557        45.71
     326.143     0.981250        37671        53.33
     351.743     0.984375        37791        64.00
     365.055     0.985938        37851        71.11
     383.231     0.987500        37912        80.00
     401.919     0.989062        37971        91.43
     430.847     0.990625        38031       106.67
     470.015     0.992188        38091       128.00
     492.031     0.992969        38121       142.22
     531.455     0.993750        38151       160.00
     561.663     0.994531        38181       182.86
     581.631     0.995313        38211       213.33
     613.887     0.996094        38241       256.00
     637.439     0.996484        38256       284.44
     651.263     0.996875        38272       320.00
     673.791     0.997266        38286       365.71
     719.871     0.997656        38301       426.67
     834.047     0.998047        38316       512.00
     874.495     0.998242        38323       568.89
     944.127     0.998437        38331       640.00
    1026.559     0.998633        38338       731.43
    1064.959     0.998828        38346       853.33
    1177.599     0.999023        38353      1024.00
    1246.207     0.999121        38357      1137.78
    1335.295     0.999219        38361      1280.00
    1359.871     0.999316        38364      1462.86
    1384.447     0.999414        38368      1706.67
    1723.391     0.999512        38372      2048.00
    2070.527     0.999561        38374      2275.56
    2308.095     0.999609        38376      2560.00
    2525.183     0.999658        38377      2925.71
    2686.975     0.999707        38379      3413.33
    2959.359     0.999756        38381      4096.00
    3244.031     0.999780        38382      4551.11
    3274.751     0.999805        38383      5120.00
    3485.695     0.999829        38384      5851.43
    3842.047     0.999854        38385      6826.67
    3919.871     0.999878        38386      8192.00
    3919.871     0.999890        38386      9102.22
    4118.527     0.999902        38387     10240.00
    4118.527     0.999915        38387     11702.86
    4186.111     0.999927        38388     13653.33
    4186.111     0.999939        38388     16384.00
    4186.111     0.999945        38388     18204.44
    4448.255     0.999951        38389     20480.00
    4448.255     0.999957        38389     23405.71
    4448.255     0.999963        38389     27306.67
    4448.255     0.999969        38389     32768.00
    4448.255     0.999973        38389     36408.89
    4804.607     0.999976        38390     40960.00
    4804.607     1.000000        38390          inf
#[Mean    =       98.388, StdDeviation   =      109.675]
#[Max     =     4800.512, Total count    =        38390]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  47169 requests in 1.00m, 20.87MB read
  Socket errors: connect 0, read 0, write 0, timeout 46
Requests/sec:    786.07
Transfer/sec:    356.20KB